app/Controllers/Admin/QuejasController.php

SELECT `queja`.*, `prioridad`.`tipoPrioridad`, concat(usuarios.nombre, " ", `usuarios`.`apaterno`, " ", usuarios.amaterno) as nombre_usuario
FROM `queja`
JOIN `prioridad` ON `prioridad`.`id` = `queja`.`id_prioridad`
JOIN `usuarios` ON `usuarios`.`id` = `queja`.`id_usuarios`
WHERE `queja`.`deleted_at` IS NULL
---
    public function index()
    {
        helper(['form', 'url']);

        $QuejaModel = model('QuejaModel');
        $UsuarioModel = model('UsuarioModel'); // Agrega esta línea para cargar el modelo de Usuario

        // Seleccionar todas las quejas con los nombres de los usuarios y su información de prioridad
        $quejas = $QuejaModel->select('queja.*, prioridad.tipoPrioridad, concat(usuarios.nombre, " ", usuarios.apaterno, " ", usuarios.amaterno) as nombre_usuario')
                             ->join('prioridad', 'prioridad.id = queja.id_prioridad')
                             ->join('usuarios', 'usuarios.id = queja.id_usuarios')
                             ->findAll();

SELECT *
FROM `queja`
WHERE `queja`.`deleted_at` IS NULL
AND `queja`.`id` = '31'
SELECT `prioridad`.`tipoPrioridad`
FROM `queja`
JOIN `prioridad` ON `prioridad`.`id` = `queja`.`id_prioridad`
WHERE `queja`.`id` = '31'
AND `queja`.`deleted_at` IS NULL
 LIMIT 1
SELECT CONCAT(usuarios.nombre, " ", `usuarios`.`apaterno`, " ", usuarios.amaterno) as nombre_completo
FROM `queja`
JOIN `usuarios` ON `usuarios`.`id` = `queja`.`id_usuarios`
WHERE `queja`.`id` = '31'
AND `queja`.`deleted_at` IS NULL
 LIMIT 1
---
    public function show($id = null)
    {
        // Verifica si se proporcionó un ID válido
        if ($id === null) {
            return redirect()->to(base_url('admin/quejas'))->with('error', 'ID de queja no proporcionado.');
        }

        // Carga el modelo de Queja
        $QuejaModel = model('QuejaModel');

        // Busca la queja por su ID
        $queja = $QuejaModel->find($id);

        // Verifica si se encontró la queja
        if ($queja === null) {
            return redirect()->to(base_url('admin/quejas'))->with('error', 'No se encontró la queja.');
        }

        // Obtiene la información del tipo de prioridad
        $prioridad = $QuejaModel->select('prioridad.tipoPrioridad')
        ->join('prioridad', 'prioridad.id = queja.id_prioridad')
        ->where('queja.id', $id)
        ->first();

        // Obtiene la información del usuario
        $usuario = $QuejaModel->select('CONCAT(usuarios.nombre, " ", usuarios.apaterno, " ", usuarios.amaterno) as nombre_completo')
        ->join('usuarios', 'usuarios.id = queja.id_usuarios')
        ->where('queja.id', $id)
        ->first();

SELECT *
FROM `queja`
WHERE `queja`.`deleted_at` IS NULL
AND `queja`.`id` = '31'
SELECT *
FROM `retroalimentacion`
WHERE `id_queja` = '31'
SELECT *
FROM `retroalimentacion`
WHERE `id` = '17'
 LIMIT 1
---
    public function retroalimentaciones($id = null)
    {
        // Verifica si se proporcionó un ID válido
        if ($id === null) {
            return redirect()->to(base_url('admin/quejas'))->with('error', 'ID de queja no proporcionado.');
        }

        // Carga el modelo de Queja
        $QuejaModel = model('QuejaModel');

        // Busca la queja por su ID
        $queja = $QuejaModel->find($id);

        // Verifica si se encontró la queja
        if ($queja === null) {
            return redirect()->to(base_url('admin/quejas'))->with('error', 'No se encontró la queja.');
        }

        // Carga el modelo de Retroalimentacion
        $RetroalimentacionModel = model('RetroalimentacionModel');

        // Busca retroalimentaciones anteriores para esta queja
        $retroalimentaciones = $RetroalimentacionModel->where('id_queja', $id)->findAll();

                 // Obtener respuestas de retroalimentaciones si existen
            foreach ($retroalimentaciones as &$retroalimentacion) {
                $respuesta = $RetroalimentacionModel->where('id', $retroalimentacion['id'])->first();