app/Controllers/Usuario/AAdminController.php

    public function index()
    {
        helper(['form', 'url']);
        $QuejaModel = model('QuejaModel');

        $data['quejas'] = $QuejaModel->findAll();
---
SELECT *
FROM `queja`
WHERE `queja`.`deleted_at` IS NULL