app/Controllers/Usuario/CEscolarController.php

SELECT *
FROM `queja`
WHERE `queja`.`deleted_at` IS NULL
---
    public function index()
    {
        helper(['form', 'url']);
        $QuejaModel = model('QuejaModel');

        $data['quejas'] = $QuejaModel->findAll();