app/Controllers/Usuario/MQuejasController.php

SELECT `queja`.*, `prioridad`.`tipoPrioridad`
FROM `queja`
JOIN `prioridad` ON `prioridad`.`id` = `queja`.`id_prioridad`
WHERE `queja`.`id_usuarios` = '3'
AND `queja`.`deleted_at` IS NULL
---
    public function index()
    {
        helper(['form', 'url']);

        $QuejaModel = model('QuejaModel');

        // Obtener el ID del usuario actual
        $userId = session()->get('id');

        // Seleccionar las quejas del usuario actual y su información de prioridad
        $quejas = $QuejaModel->select('queja.*, prioridad.tipoPrioridad')
                             ->where('queja.id_usuarios', $userId)
                             ->join('prioridad', 'prioridad.id = queja.id_prioridad')
                             ->findAll();

SELECT *
FROM `retroalimentacion`
WHERE `id_queja` = '31'
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function feedback($id = null)
    {
        // Verifica si se proporcionó un ID válido
        if ($id === null) {
            return redirect()->to(base_url('usuario/mquejas'))->with('error', 'ID de queja no proporcionado.');
        }

        // Carga el modelo de Retroalimentación
        $RetroalimentacionModel = model('RetroalimentacionModel');

        // Busca la retroalimentación más reciente por el ID de la queja
        $feedback = $RetroalimentacionModel->where('id_queja', $id)
                                            ->orderBy('created_at', 'desc')
                                            ->first();